# Pandas 101
- 각 문제당 5점

In [1]:
import sys
!{sys.executable} -m pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.7/site-packages (1.0.1)
Requirement already satisfied: python-dateutil>=2.6.1 in /opt/anaconda3/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /opt/anaconda3/lib/python3.7/site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in /opt/anaconda3/lib/python3.7/site-packages (from pandas) (1.18.5)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

## 1. pandas를 pd로 명명하며 import하기

In [1]:
#TODO

## 2. data.csv 파일을 Dataframe으로 읽고, df라는 변수에 저장하기

In [2]:
#TODO

## 3. Dataframe의 head 10개 확인하기

In [4]:
#TODO

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

## 4. dataframe의 info method를 사용하여, 데이터의 개수 구하기

In [5]:
#TODO

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## 5. feature이름 재정의하기
- race/ethnicity -> race_ethnicity
- parental level of education -> parental_level_of_education
- test preparation course -> test_preparation_course
- math score -> math_score
- reading score -> reading_score
- writing score -> writing_score

In [7]:
#TODO

In [8]:
df.columns

Index(['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score'],
      dtype='object')

## 6. race/ethnicity에 몇가지 종류의 그룹이 있는지 확인하기

In [10]:
#TODO

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

## 7. parental level of education에서 각각의 그룹에 몇명이 해당하는지 확인하기

In [11]:
#TODO

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental_level_of_education, dtype: int64

## 8. 수학 점수의 평균/중간값/최소/최대와 같은 통계값 구하기

In [12]:
#TODO

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math_score, dtype: float64

## 9. 여학생들의 읽기 점수 평균 구하기

In [14]:
#TODO

72.60810810810811

## 10. 남학생중에 쓰기 점수 상위 10명 구하기

In [15]:
#TODO

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
916,male,group E,bachelor's degree,standard,completed,100,100,100
625,male,group D,some college,standard,completed,100,97,99
381,male,group C,associate's degree,standard,completed,87,100,95
149,male,group E,associate's degree,free/reduced,completed,100,100,93
121,male,group B,associate's degree,standard,completed,91,89,92
571,male,group A,bachelor's degree,standard,none,91,96,92
562,male,group C,bachelor's degree,standard,completed,96,90,92
864,male,group C,associate's degree,standard,none,97,93,91
612,male,group C,bachelor's degree,standard,completed,94,90,91
919,male,group B,some college,standard,completed,91,96,91

## 11. 기존 df에 total score라는 속성을 추가하기
- total score = math score + reading score + writing score

In [17]:
#TODO

In [18]:
df

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282
996,male,group C,high school,free/reduced,none,62,55,55,172
997,female,group C,high school,free/reduced,completed,59,71,65,195
998,female,group D,some college,standard,completed,68,78,77,223
999,female,group D,some college,free/reduced,none,77,86,86,249

## 12. total score 가 290점 '이상'(>=)인 학생들 추출하기

In [19]:
#TODO

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
114,female,group E,bachelor's degree,standard,completed,99,100,100,299
149,male,group E,associate's degree,free/reduced,completed,100,100,93,293
165,female,group C,bachelor's degree,standard,completed,96,100,100,296
179,female,group D,some high school,standard,completed,97,100,100,297
458,female,group E,bachelor's degree,standard,none,100,100,100,300
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100,292
594,female,group C,bachelor's degree,standard,completed,92,100,99,291
625,male,group D,some college,standard,completed,100,97,99,296
685,female,group E,master's degree,standard,completed,94,99,100,293
712,female,group D,some college,standard,none,98,100,99,297
717,female,group C,associate's degree,standard,completed,96,96,99,291
855,female,group B,bachelor's degree,standard,none,97,97,96,290
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100,293
916,male,group E,bachelor's degree,standard,completed,100,100,100,300
957,female,group D,master's degree,standard,none,92,100,100,292
962,female,group E,associate's degree,standard,none,100,100,100,300

## 13. total score 가 200점 '이하'(<=)인 학생들 중 남학생의 비율 구하기

In [16]:
#TODO

0.5398230088495575

## 14. 성별 별 total score의 평균 구하기

In [28]:
#TODO

gender
female    208.708494
male      197.512448
Name: total_score, dtype: float64

## 15. race/ethnicity 별 total score의 평균 구하기

In [29]:
#TODO

race_ethnicity
group A    188.977528
group B    196.405263
group C    201.394984
group D    207.538168
group E    218.257143
Name: total_score, dtype: float64

## 16. parental_level_of_education 별 평균 구하기

In [19]:
#TODO

parental_level_of_education
associate's degree    208.707207
bachelor's degree     215.771186
high school           189.290816
master's degree       220.796610
some college          205.429204
some high school      195.324022
Name: total_score, dtype: float64

## 17. race/ethnicity와 성별 별로 total score의 평균 구하기

In [20]:
#TODO

race_ethnicity  gender
group A         female    195.388889
                male      184.622642
group B         female    202.528846
                male      189.000000
group C         female    205.755556
                male      195.748201
group D         female    214.317829
                male      200.962406
group E         female    222.188406
                male      214.436620
Name: total_score, dtype: float64

## 18. parental_level_of_education이 high school (both some high school, highschool) 인 학생들 수 구하기
- 각각을 구한 다음에 더하는 방식 X
- hint: use apply

In [21]:
#TODO

375

## 19. 점수들간의 상관관계 구하기

In [22]:
#TODO

               math_score  writing_score  reading_score  total_score
math_score       1.000000       0.802642       0.817580     0.918746
writing_score    0.802642       1.000000       0.954598     0.965667
reading_score    0.817580       0.954598       1.000000     0.970331
total_score      0.918746       0.965667       0.970331     1.000000